//
//package com.atwoz.profile.ui;
//
//import org.junit.jupiter.api.DisplayNameGeneration;
//import org.junit.jupiter.api.DisplayNameGenerator.ReplaceUnderscores;
//import org.junit.jupiter.api.Test;
//
//import static com.atwoz.profile.fixture.프로필_요청_픽스처.프로필_필터_요청_픽스처.프로필_필터_요청_생성;
//
//@DisplayNameGeneration(ReplaceUnderscores.class)
//@SuppressWarnings("NonAsciiCharacters")
//class ProfileControllerAcceptanceTest extends ProfileControllerAcceptanceFixture {
//
//    @Test
//    void 닉네임_중복을_확인한다() {
//        // given
//        var 닉네임 = 새로운_닉네임();
//
//        // when
//        var 닉네임_중복_확인_결과 = 닉네임_중복을_확인한다(닉네임_중복_검증_URL, 토큰, 닉네임);
//
//        // then
//        닉네임_중복_확인_검증(닉네임_중복_확인_결과);
//    }
//
//    @Test
//    void 오늘의_이성_추천_프로필을_조회한다() {
//        // given
//        var 다이아_등급_회원 = 다이아_등급_이성_프로필_생성();
//        var 골드_등급_회원 = 골드_등급_이성_회원_생성();
//        var 프로필_필터_요청서 = 프로필_필터_요청_생성();
//
//        // when
//        var 오늘의_이성_추천_프로필_조회_요청_결과 = 프로필_조회_요청(오늘의_이성_추천_프로필_조회_URL, 토큰, 프로필_필터_요청서);
//
//        // then
//        오늘의_이성_추천_프로필_조회_요청_검증(오늘의_이성_추천_프로필_조회_요청_결과, 골드_등급_회원, 다이아_등급_회원);
//    }
//
//    @Test
//    void 인기있는_이성_회원_프로필을_조회한다() {
//        // given
//        var 인기있는_회원 = 인기있는_이성_프로필_생성();
//        var 프로필_필터_요청서 = 프로필_필터_요청_생성();
//
//        // when
//        var 인기있는_이성_회원_프로필_조회_요청_결과 = 프로필_조회_요청(인기있는_이성_회원_프로필_조회_URL, 토큰, 프로필_필터_요청서);
//
//        // then
//        이성_회원_프로필_조회_요청_검증(인기있는_이성_회원_프로필_조회_요청_결과, 인기있는_회원);
//    }
//
//    @Test
//    void 오늘_방문한_이성_회원_프로필을_조회한다() {
//        // given
//        var 오늘_방문한_회원 = 오늘_방문한_이성_프로필_생성();
//        var 프로필_필터_요청서 = 프로필_필터_요청_생성();
//
//        // when
//        var 오늘_방문한_이성_회원_프로필_조회_요청_결과 = 프로필_조회_요청(오늘_방문한_이성_회원_프로필_조회_URL, 토큰, 프로필_필터_요청서);
//
//        // then
//        이성_회원_프로필_조회_요청_검증(오늘_방문한_이성_회원_프로필_조회_요청_결과, 오늘_방문한_회원);
//    }
//
//    @Test
//    void 근처에_있는_이성_회원_프로필을_조회한다() {
//        // given
//        var 근처에_있는_회원 = 근처에_있는_이성_프로필_생성();
//        var 프로필_필터_요청서 = 프로필_필터_요청_생성();
//
//        // when
//        var 근처에_있는_이성_회원_프로필_조회_결과 = 프로필_조회_요청(근처에_있는_이성_회원_프로필_조회_URL, 토큰, 프로필_필터_요청서);
//
//        // then
//        이성_회원_프로필_조회_요청_검증(근처에_있는_이성_회원_프로필_조회_결과, 근처에_있는_회원);
//    }
//
//    @Test
//    void 최근에_가입한_이성_회원_프로필을_조회한다() {
//        // given
//        var 최근에_가입한_회원 = 최근에_가입한_이성_프로필_생성();
//        var 프로필_필터_요청서 = 프로필_필터_요청_생성();
//
//        // when
//        var 최근에_가입한_이성_회원_프로필_조회_결과 = 프로필_조회_요청(최근에_가입한_이성_회원_프로필_조회_URL, 토큰, 프로필_필터_요청서);
//
//        // then
//        이성_회원_프로필_조회_요청_검증(최근에_가입한_이성_회원_프로필_조회_결과, 최근에_가입한_회원);
//    }
//
//    @Test
//    void 종교가_같은_이성_회원_프로필을_조회한다() {
//        // given
//        var 종교가_같은_회원 = 종교가_같은_이성_프로필_생성();
//        var 프로필_필터_요청서 = 프로필_필터_요청_생성();
//
//        // when
//        var 종교가_같은_이성_회원_프로필_조회_결과 = 프로필_조회_요청(종교가_같은_이성_회원_프로필_조회_URL, 토큰, 프로필_필터_요청서);
//
//        // then
//        이성_회원_프로필_조회_요청_검증(종교가_같은_이성_회원_프로필_조회_결과, 종교가_같은_회원);
//    }
//
//    @Test
//    void 취미가_같은_이성_회원_프로필을_조회한다() {
//        // given
//        var 취미가_같은_회원 = 취미가_같은_이성_프로필_생성();
//        var 프로필_필터_요청서 = 프로필_필터_요청_생성();
//
//        // when
//        var 취미가_같은_이성_회원_프로필_조회_결과 = 프로필_조회_요청(취미가_같은_이성_회원_프로필_조회_URL, 토큰, 프로필_필터_요청서);
//
//        // then
//        이성_회원_프로필_조회_요청_검증(취미가_같은_이성_회원_프로필_조회_결과, 취미가_같은_회원);
//    }
//}
